Repository: 0ye0m/kubernetes-
Catalog: translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: jp_jp, pl_pl, zh_cn

source: Apply a configuration to a resource by filename or stdin
jp_jp: ファイル名または標準入力でリソースにコンフィグを適用する
pl_pl: Zastosuj konfigurację do zasobu według nazwy pliku lub stdin
zh_cn: 通过文件或者标准输入的读取方式apply一个资源

source: Delete the specified cluster from the kubeconfig
jp_jp: kubeconfigから指定したクラスターを削除する
pl_pl: Usuń określony klaster z kubeconfig
zh_cn: 从kubeconfig配置文件中删除指定的集群

source: Delete the specified context from the kubeconfig
jp_jp: kubeconfigから指定したコンテキストを削除する
pl_pl: Usuń określony kontekst z kubeconfig
zh_cn: 从kubeconfig配置文件中删除指定的上下文

source: Describe one or many contexts
jp_jp: １つまたは複数のコンテキストを記述する
pl_pl: Opisz jeden lub wiele kontekstów
zh_cn: 描述一个或更多上下文

source: Display clusters defined in the kubeconfig
jp_jp: kubeconfigで定義されたクラスターを表示する
pl_pl: Wyświetl klastry zdefiniowane w kubeconfig
zh_cn: 从kubeconfig配置文件中显示指定的集群

source: Display merged kubeconfig settings or a specified kubeconfig file
jp_jp: kubeconfig設定または指示したkubeconfigファイルを表示する
pl_pl: Wyświetl scalone ustawienia kubeconfig lub określony plik kubeconfig
zh_cn: 显示合并的集群或者指定的kubeconfig配置文件

source: Displays the current-context
jp_jp: 現在のコンテキストを表示する
pl_pl: Wyświetl bieżący kontekst
zh_cn: 显示当前的上下文

source: Modify kubeconfig files
jp_jp: kubeconfigファイルを編集する
pl_pl: Zmodyfikuj pliki kubeconfig
zh_cn: 修改kubeconfig配置文件

source: Sets a cluster entry in kubeconfig
jp_jp: kubeconfigにクラスターエントリを設定する
pl_pl: Ustawia pozycję klastra w kubeconfig
zh_cn: 从kubeconfig配置文件中设置一个集群条目

source: Sets a context entry in kubeconfig
jp_jp: kubeconfigにコンテキストエントリを設定する
pl_pl: Ustawia pozycję kontekstu w kubeconfig
zh_cn: 从kubeconfig配置文件中设置一个上下文条目

source: Sets a user entry in kubeconfig
jp_jp: kubeconfigにユーザーエントリを設定する
pl_pl: Ustawia wpis użytkownika w kubeconfig
zh_cn: 从kubeconfig配置文件中设置一个用户条目

source: Sets an individual value in a kubeconfig file
jp_jp: kubeconfigファイルに単一値を設定する
pl_pl: Ustawia indywidualną wartość w pliku kubeconfig
zh_cn: 从kubeconfig配置文件中设置一个单独值

source: Sets the current-context in a kubeconfig file
jp_jp: kubeconfigに現在のコンテキストを設定する
pl_pl: Ustawia bieżący kontekst w pliku kubeconfig
zh_cn: 从kubeconfig配置文件中设置当前的上下文

source: Unsets an individual value in a kubeconfig file
jp_jp: kubeconfigに単一値の設定を削除する
pl_pl: Usuwa pojedynczą wartość w pliku kubeconfig
zh_cn: 从kubeconfig配置文件中取消设置一个单独值

source: Update the annotations on a resource
jp_jp: リソースでのあのテーショーンを更新する
pl_pl: Zaktualizuj adnotacje w zasobie
zh_cn: 更新一个资源的注解

source: watch is only supported on individual resources and resource collections - %d resources were found
jp_jp: watchは単一リソース及びリソースコレクションでのみサポートされている - リソース %d が見つかった
pl_pl: zegar jest zgodny tylko z pojedynczymi zasobami i kolekcjami zasobów. - znaleziono %d zasobów
zh_cn: watch 仅在单独的一个资源或者一个资源集合上被支持 -资源 %d 被发现
